app/Http/Controllers/AccountController.php

    public function index()
    {
        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories
---
select * from `categories` order by `name` asc