app/Http/Controllers/AddressController.php

    public function index()
    {
        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories

        $addresses = Address::where('user_id', Auth::user()->id)->get();
---
select * from `categories` order by `name` asc
select * from `addresses` where `user_id` = 1

    public function formAdd()
    {
        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories
---
select * from `categories` order by `name` asc

    public function formEdit($id)
    {
        $address = Address::findOrFail($id);

        $categories = Category::orderBy('name', 'asc')->get();
---
select * from `addresses` where `addresses`.`id` = '1' limit 1
select * from `categories` order by `name` asc