app/Http/Controllers/CartController.php

    public function index()
    {
        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories

        $carts = Cart::Where('user_id', Auth::user()->id)->get();
        $products = Product::OrderBy('created_at', 'asc')->paginate(5);
        $somme = 0;

        $orders = Order::where('user_id', Auth::user()->id)->get();
---
select * from `categories` order by `name` asc
select * from `carts` where `user_id` = 1
select * from `products` order by `created_at` asc limit 5 offset 0
select count(*) as aggregate from `products`
select * from `orders` where `user_id` = 1

    public function addToCart(Product $product)
    {

        // Vérification du produit dans le panier
        // Sélectionner le produit quand il a été ajouté par l'utilisateur
        // SELECT * FROM Carts WHERE user_id = "?" AND product_id = $product -> id LIMIT(0, 1)

        $cart = Cart::Where('user_id', Auth::user()->id)
            ->Where('product_id', $product->id)
            ->first();

        // Penser à controler l'existence du produit

        if (isset($cart)) {

            // UPDATE Carts SET quantity = 1 WHERE id = 1

            Cart::Where('id', $cart->id)->update(['quantity' => $cart->quantity + 1]);
        } else {

            Cart::Create([
                "user_id" => Auth::user()->id,
                "product_id" => $product->id,
                "quantity" => 1,
                "prix" => $product->prix
            ]);
---
select * from `carts` where `user_id` = 1 and `product_id` = 12 limit 1
insert into `carts` (`user_id`, `product_id`, `quantity`, `prix`, `updated_at`, `created_at`) values (1, 12, 1, '79.00', '2023-07-04 13:06:07', '2023-07-04 13:06:07')

    public function incrementCartItem(Product $product)
    {
        // Vérifier si le produit existe dans le panier de l'utilisateur
        $cartItem = Cart::where('user_id', Auth::user()->id)
            ->where('product_id', $product->id)
            ->first();

        if ($cartItem) {
            // Incrémenter la quantité du produit dans le panier
            $cartItem->update(['quantity' => $cartItem->quantity + 1]);
---
select * from `carts` where `user_id` = 1 and `product_id` = 6 limit 1
update `carts` set `quantity` = 2, `carts`.`updated_at` = '2023-07-04 12:44:52' where `id` = 1

    public function decrementCartItem(Product $product)
    {
        // Vérifier si le produit existe dans le panier de l'utilisateur
        $cartItem = Cart::where('user_id', Auth::user()->id)
            ->where('product_id', $product->id)
            ->first();

        if ($cartItem) {
            // Décrémenter la quantité du produit dans le panier
            if ($cartItem->quantity > 1) {
                $cartItem->update(['quantity' => $cartItem->quantity - 1]);
            } else {
                // Si la quantité est déjà 1, supprimer l'élément du panier
                $cartItem->delete();
---
select * from `carts` where `user_id` = 1 and `product_id` = 6 limit 1
update `carts` set `quantity` = 2, `carts`.`updated_at` = '2023-07-04 12:47:48' where `id` = 1
delete from `carts` where `id` = 1

    public function delete(Product $product)
    {
        // Vérifier si le produit existe dans le panier de l'utilisateur
        $cartItem = Cart::where('user_id', Auth::user()->id)
            ->where('product_id', $product->id)
            ->first();

        // Vérifier si l'élément du panier existe
        if (!$cartItem) {
            return redirect()->back()->with('error', 'L\'élément du panier n\'existe pas.');
        }

        // dd($product);

        // Supprimer l'élément du panier
        $cartItem->delete();
---
select * from `carts` where `user_id` = 1 and `product_id` is null limit 1
delete from `carts` where `id` = 4

    public function clearCart()
    {
        // Supprimer tous les éléments du panier pour l'utilisateur connecté
        Cart::where('user_id', Auth::user()->id)->delete();
---
delete from `carts` where `user_id` = 1