app/Http/Controllers/CheckoutController.php

    public function checkout()
    {
        $categories = Category::orderBy('name', 'asc')->get(); // liste de mes catégories

        // Récupérer le panier de l'utilisateur
        $cartItems = Cart::where('user_id', Auth::user()->id)->get();

        // Calculer la somme du panier
        $total = 0;
        foreach ($cartItems as $cartItem) {
            $total += $cartItem->quantity * $cartItem->prix;
        }

        $date = now(); // Obtient la date et l'heure actuelles

        // Convertir la date en format jour-mois-année
        $dateString = $date->format('d-m-Y');

        // Générer un uniqid
        $uniqid = uniqid();

        // Concaténer la date et uniqid
        $reference = $dateString . '-' . $uniqid;

        // Vérifier si une commande en cours existe pour l'utilisateur
        $order = Order::where('user_id', Auth::user()->id)->where('statut', 0)->first();

        if ($order) {
            // Mise à jour de la commande existante
            $order->somme = $total;
            $order->save();

            // Mettre à jour les détails de la commande existants
            foreach ($order->orderDetails as $orderDetail) {
---
select * from `categories` order by `name` asc
select * from `carts` where `user_id` = 1
select * from `orders` where `user_id` = 1 and `statut` = 0 limit 1
update `orders` set `somme` = 855, `orders`.`updated_at` = '2023-07-04 13:18:49' where `id` = 87
select * from `order_details` where `order_details`.`order_id` = 87 and `order_details`.`order_id` is not null

            }
        } else {
            // Création d'une nouvelle commande
            $order = Order::create([
                'user_id' => Auth::user()->id,
                'somme' => $total,
                'statut' => 0,
                'reference' => $reference
            ]);
---
insert into `orders` (`user_id`, `somme`, `statut`, `reference`, `updated_at`, `created_at`) values (1, 0, 0, '04-07-2023-64a41b1d15df5', '2023-07-04 13:14:05', '2023-07-04 13:14:05')

    private function updateOrderDetails()
    {
        // Récupérer l'utilisateur connecté
        $user = Auth::user();

        // Récupérer la commande en cours de l'utilisateur avec un statut de 0 (non payée)
        $order = Order::where('user_id', $user->id)->where('statut', 0)->first();

        // Récupérer le panier de l'utilisateur
        $cartItems = Cart::where('user_id', $user->id)->get();

        // Mettre à jour les détails de la commande
        foreach ($cartItems as $cartItem) {
            // Vérifier si le produit existe déjà dans les détails de commande
            $orderDetail = OrderDetail::where('order_id', $order->id)->where('product_id', $cartItem->product_id)->first();

            if ($orderDetail) {
                // Le produit existe déjà, mettre à jour les propriétés
                $orderDetail->quantity = $cartItem->quantity;
                $orderDetail->prix = $cartItem->prix;
                $orderDetail->save();
            } else {
                // Le produit n'existe pas, créer un nouveau détail de commande
                $product = Product::find($cartItem->product_id);

                OrderDetail::create([
                    'order_id' => $order->id,
                    'product_id' => $cartItem->product_id,
                    'product_name' => $product->name,
                    'category_name' => $product->category->name,
                    'quantity' => $cartItem->quantity,
                    'prix' => $cartItem->prix,
                ]);
---
select * from `orders` where `user_id` = 1 and `statut` = 0 limit 1
select * from `carts` where `user_id` = 1
select * from `order_details` where `order_id` = 87 and `product_id` = 8 limit 1
select * from `products` where `products`.`id` = 8 limit 1
insert into `order_details` (`order_id`, `product_id`, `product_name`, `category_name`, `quantity`, `prix`, `updated_at`, `created_at`) values (87, 8, 'Kayden Pouros', 'Iphone', 1, '855', '2023-07-04 13:18:49', '2023-07-04 13:18:49')