app/Http/Controllers/OrderController.php

    public function index()
    {
        //
        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories

        $orders = Order::orderBy('created_at', 'desc')->get();
---
select * from `categories` order by `name` asc
select * from `orders` order by `created_at` desc

    public function show($reference)
    {
        $categories = Category::orderBy('name', 'asc')->get();
        $order = Order::where('reference', $reference)->first();

        $selectedAddress = OrderAddress::where('order_id', $order->id)->first();
        $selectedCarrier = OrderCarrier::where('order_id', $order->id)->first();

        // Récupérer les détails de la commande spécifique
        $orderDetails = $order->orderDetails;

        $product_image = DB::table('order_details')
            ->join('products', 'order_details.product_id', '=', 'products.id')
            ->where('order_details.order_id', $order->id)
            ->select('products.image')
            ->get();
---
select * from `categories` order by `name` asc
select * from `orders` where `reference` = '12-06-2023-64875fc5b20c1' limit 1
select * from `order_addresses` where `order_id` = 86 limit 1
select * from `order_carriers` where `order_id` = 86 limit 1
select * from `order_details` where `order_details`.`order_id` = 86 and `order_details`.`order_id` is not null
select `products`.`image` from `order_details` inner join `products` on `order_details`.`product_id` = `products`.`id` where `order_details`.`order_id` = 86