app/Http/Controllers/ProductController.php

    public function index($category = 0)
    {
        //Lister les produits et les categories et filtrer les categories par les produits

        $products = Product::OrderBy('created_at', 'asc')->paginate(10); // liste de mes produits

        if ($category != 0) {
            # code...
            $products = Product::Where('category_id', $category)->OrderBy('created_at', 'asc')->paginate(10);
        }

        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories
---
select * from `products` order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `products`
select * from `products` where `category_id` = '2' order by `created_at` asc limit 10 offset 0
select count(*) as aggregate from `products` where `category_id` = '2'
select * from `categories` order by `name` asc

    public function detail(Product $product)
    {

        //selectionner 4 produits qui ont la même catégorie qu'un produit aléatoirement
        $products = Product::Where('category_id', $product->category_id)->inRandomOrder()->limit(4)->get();
        $categories = Category::OrderBy('name', 'asc')->get(); // liste de mes catégories
---
select * from `products` where `category_id` = 2 order by RAND() limit 4
select * from `categories` order by `name` asc