app/Http/Controllers/ShippingController.php

select * from `categories` order by `name` asc
select * from `orders` where `user_id` = 1 and `statut` = 0 limit 1
select * from `order_carriers` where `order_carriers`.`order_id` = 87 and `order_carriers`.`order_id` is not null limit 1
select * from `carriers`
---
    public function shipping()
    {
        $categories = Category::orderBy('name', 'asc')->get();
        $user = Auth::user();
        $addresses = $user->addresses;

        // Récupérer l'adresse sélectionnée de la commande en cours de l'utilisateur
        $order = Order::where('user_id', $user->id)->where('statut', 0)->first();

        // Récupérer le transporteur sélectionné de la commande en cours de l'utilisateur
        $orderCarrier = OrderCarrier::where('order_id', $order->id)->first();

        // Récupérer les transporteurs disponibles
        $carriers = Carrier::all();